Revit 2024 API
ExporterIFC.RegisterFaceWithElementHandle Method
 Register face with element handle to make sure the openings created are related to the right element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void RegisterFaceWithElementHandle(
	Face face,
	IFCAnyHandle elemHandle
)
Visual Basic
Public Sub RegisterFaceWithElementHandle ( _
	face As Face, _
	elemHandle As IFCAnyHandle _
)
Visual C++
public:
void RegisterFaceWithElementHandle(
	Face^ face,
	IFCAnyHandle^ elemHandle
)
Parameters
face
Type: Autodesk.Revit.DB.Face
 The face.
elemHandle
Type: Autodesk.Revit.DB.IFC.IFCAnyHandle
 The element handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace